microsoft/uf2-samdx1/lib/samd21/samd21c/atdf/ATSAMD21E16CU.atdf
        <register name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="USART Status">
          <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
          <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
          <bitfield name="CTS" caption="Clear To Send" mask="0x8"/>
          <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10"/>
          <bitfield name="COLL" caption="Collision Detected" mask="0x20"/>
        </register>
        <register name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USART Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="SERCOM_I2CM_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
    </module>
    <module name="SYSCTRL" id="U2100" version="2.0.1" caption="System Control">
      <register-group name="SYSCTRL" caption="System Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready Interrupt Enable" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection Interrupt Enable" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready Interrupt Enable" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x20000"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready Interrupt Enable" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection Interrupt Enable" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready Interrupt Enable" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x20000"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x20000"/>
        </register>
        <register name="PCLKSR" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x20000"/>
        </register>
        <register name="XOSC" offset="0x10" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700" values="SYSCTRL_XOSC__GAIN"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000"/>
        </register>
