microsoft/uf2-samdx1/lib/samd21/samd21c/atdf/ATSAMD21E16CU.atdf
        <register offset="0x00000180" size="4" name="NVICICPR" initval="0" caption="Interrupt Clear Pending Register">
          <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
        </register>
        <register offset="0x00000300" size="4" name="NVICIPR0" initval="0" caption="Interrupt Priority Register 0">
          <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
          <bitfield mask="0x0000ff00" name="PRI1" caption="Priority of interrupt 1"/>
          <bitfield mask="0x00ff0000" name="PRI2" caption="Priority of interrupt 2"/>
          <bitfield mask="0xff000000" name="PRI3" caption="Priority of interrupt 3"/>
        </register>
        <register offset="0x00000304" size="4" name="NVICIPR1" initval="0" caption="Interrupt Priority Register 1">
          <bitfield mask="0x000000ff" name="PRI4" caption="Priority of interrupt 4"/>
          <bitfield mask="0x0000ff00" name="PRI5" caption="Priority of interrupt 5"/>
          <bitfield mask="0x00ff0000" name="PRI6" caption="Priority of interrupt 6"/>
          <bitfield mask="0xff000000" name="PRI7" caption="Priority of interrupt 7"/>
        </register>
        <register offset="0x00000308" size="4" name="NVICIPR2" initval="0" caption="Interrupt Priority Register 2">
          <bitfield mask="0x000000ff" name="PRI8" caption="Priority of interrupt 8"/>
          <bitfield mask="0x0000ff00" name="PRI9" caption="Priority of interrupt 9"/>
          <bitfield mask="0x00ff0000" name="PRI10" caption="Priority of interrupt 10"/>
          <bitfield mask="0xff000000" name="PRI11" caption="Priority of interrupt 11"/>
        </register>
        <register offset="0x0000030C" size="4" name="NVICIPR3" initval="0" caption="Interrupt Priority Register 3">
          <bitfield mask="0x000000ff" name="PRI12" caption="Priority of interrupt 12"/>
          <bitfield mask="0x0000ff00" name="PRI13" caption="Priority of interrupt 13"/>
          <bitfield mask="0x00ff0000" name="PRI14" caption="Priority of interrupt 14"/>
          <bitfield mask="0xff000000" name="PRI15" caption="Priority of interrupt 15"/>
        </register>
        <register offset="0x00000310" size="4" name="NVICIPR4" initval="0" caption="Interrupt Priority Register 4">
          <bitfield mask="0x000000ff" name="PRI16" caption="Priority of interrupt 16"/>
          <bitfield mask="0x0000ff00" name="PRI17" caption="Priority of interrupt 17"/>
          <bitfield mask="0x00ff0000" name="PRI18" caption="Priority of interrupt 18"/>
          <bitfield mask="0xff000000" name="PRI19" caption="Priority of interrupt 19"/>
        </register>
        <register offset="0x00000314" size="4" name="NVICIPR5" initval="0" caption="Interrupt Priority Register 5">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
          <bitfield mask="0x0000ff00" name="PRI21" caption="Priority of interrupt 21"/>
          <bitfield mask="0x00ff0000" name="PRI22" caption="Priority of interrupt 22"/>
          <bitfield mask="0xff000000" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="4" name="NVICIPR6" initval="0" caption="Interrupt Priority Register 6">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
          <bitfield mask="0x0000ff00" name="PRI25" caption="Priority of interrupt 25"/>
          <bitfield mask="0x00ff0000" name="PRI26" caption="Priority of interrupt 26"/>
          <bitfield mask="0xff000000" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031C" size="4" name="NVICIPR7" initval="0" caption="Interrupt Priority Register 7">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
          <bitfield mask="0x0000ff00" name="PRI29" caption="Priority of interrupt 29"/>
          <bitfield mask="0x00ff0000" name="PRI30" caption="Priority of interrupt 30"/>
          <bitfield mask="0xff000000" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
      </register-group>
    </module></modules>
  <pinouts>
    <pinout name="SAMD21E1xBU" caption="SAMD21E1xBU">
      <pin position="A1" pad="PA00"/>
      <pin position="A2" pad="PA01"/>
      <pin position="A3" pad="GNDANA"/>
      <pin position="A4" pad="VDDANA"/>
      <pin position="A5" pad="PA06"/>
      <pin position="A6" pad="VDDIO"/>
      <pin position="B1" pad="PA30"/>
      <pin position="B2" pad="PA31"/>
      <pin position="B3" pad="PA02"/>
      <pin position="B4" pad="PA04"/>
      <pin position="B5" pad="PA07"/>
      <pin position="C1" pad="VDDCORE"/>
      <pin position="C2" pad="VDDIN"/>
      <pin position="C3" pad="PA03"/>
      <pin position="C4" pad="PA05"/>
      <pin position="C5" pad="PA08"/>
      <pin position="C6" pad="PA10"/>
      <pin position="D1" pad="GNDIO"/>
      <pin position="D2" pad="PA28"/>
      <pin position="D3" pad="GNDIO"/>
      <pin position="D4" pad="PA11"/>
      <pin position="D5" pad="PA09"/>
      <pin position="D6" pad="GNDIO"/>
      <pin position="E1" pad="RESET_N"/>
      <pin position="E2" pad="PA27"/>
      <pin position="E3" pad="PA22"/>
      <pin position="E4" pad="PA17"/>
      <pin position="E5" pad="PA16"/>
      <pin position="E6" pad="PA14"/>
      <pin position="F1" pad="PA25"/>
      <pin position="F2" pad="PA24"/>
      <pin position="F3" pad="PA23"/>
      <pin position="F4" pad="PA19"/>
      <pin position="F5" pad="PA18"/>
      <pin position="F6" pad="PA15"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>